<template>
  <div class="row gx-4 mb-5">
    <div class="col-12">
      <div class="card mb-4">
        <div class="card-header">
          <h3 class="m-0">ДОГОВОР НА ОКАЗАНИЕ УСЛУГ (ПУБЛИЧНАЯ ОФЕРТА)</h3>
          <a target="_blank" class="btn btn-secondary rounded-circle p-2" href="https://smaip.ru/lk/b24/ticket/oferta.php">
            <i class="ph-download-simple m-0" style="font-size: 18px"></i>
          </a>
        </div>
        <p>Настоящая оферта представляет собой официальное предложение Индивидуального Предпринимателя Сидоров Максим Александрович, именуемый в дальнейшем «Поставщик», действующего на основании ОГРНИП 319112100030761, адресованное неопределенному кругу лиц «Фермер», заключить договор на оказание услуг на нижеследующих условиях. </p>
        <h3 class="my-4">1. ТЕРМИНЫ</h3>
        <p>1.1 В целях единого толкования и понимания, нижеприведенные термины используются в следующем значении:
          Публичная оферта (далее – оферта) – предложение Поставщика, адресованное Фермеру - физическому лицу (фермерскому хозяйству, частному подворью), заключить договор на оказание услуг на условиях, содержащихся в настоящей публичной оферте.
        </p>
        <p>1.2 Акцепт публичной оферты (далее – акцепт, акцепт оферты) – полное и безоговорочное принятие Фермером условий настоящей публичной оферты путем совершения действий, указанных в разделе 2 публичной оферты. Акцепт оферты создает договор и признается заключенным. Договор (далее Договор или Оферта) – возмездное соглашение между Поставщиком и Фермером на оказание услуг, заключенное посредством акцепта публичной оферты. Лицо, осуществившее акцепт подтверждает, что является фермером (фермерское хозяйство, частное подворье) и несет ответственность за данную за достоверность данной информации.</p>
        <p>1.3 Поставщик – Индивидуальный Предприниматель Сидоров Максим Александрович.
        </p>
        <p>1.4 Фермер – физическое лицо (фермерское хозяйство, частное подворье), имеющее намерение получить услуги, заключившее с Поставщиком договор на условиях, содержащихся в настоящей публичной оферте. Физическое лицо (фермерское хозяйство, частное подворье), принявшее нижеизложенные условия и оплатившее услуги, признается Фермером.
        </p>
        <p>1.5 Стороны – Поставщик и Фермер, именуемые в дальнейшем при совместном упоминании.</p>
        <h3 class="my-4">2. ПРЕДМЕТ ОФЕРТЫ</h3>
        <p>2.1. Поставщик обязуется передать в собственность Фермера, а Фермер обязуется своевременно принять, оплатить и осуществить с использованием своего транспорта вывоз вторсырья (пищевых отходов) ежедневно в соответствии с согласованным графиком.</p>
        <p>2.2. Под пищевыми отходами (вторсырье) Стороны понимают не подлежащие использованию по прямому назначению пищевые продукты, которые полностью или частично потеряли свои первоначальные потребительские свойства и (или) внешний товарный вид, образованные в процессе хозяйственной деятельности на объектах.<br>Вывоз пищевых отходов производится по графику, согласованному Сторонами в любой электронной форме, указанной в п. 5.1 настоящего Договора, либо путем телефонных переговоров с использованием номера контактного телефона Фермера.</p>
        <p>Вывоз пищевых отходов производится по графику, согласованному Сторонами в любой электронной форме, указанной в п. 4.1 настоящего Договора, либо путем телефонных переговоров с использованием номера контактного телефона Покупателя, указанного в п.7 Договора.</p>
        <p>2.3. Изменение перечня отгружаемой продукции, подлежащей ежедневной отгрузке, допускается.</p>
        <h3 class="my-4">3. ОБЯЗАННОСТИ СТОРОН</h3>
        <p>3.1. Фермер обязан:</p>
        <p>3.1.1. Обеспечить собственными силами и средствами (собственным транспортом и тарой) вывоз отходов с территории объекта,  исходя из фактической потребности Поставщика и в соответствии с согласованным графиком и дополнительными условиями к настоящему Договору.</p>
        <p>3.1.2. Принимать в собственность пищевые отходы исключительно для переработке в деятельности фермерского хозяйства или личного подсобного хозяйства. Фермер обязан не продавать третьим лицам отходы, принятые у Поставщика, не употреблять их в пищу, не выкидывать в мусорные баки ТБО и урны общего пользования.</p>
        <p>3.2. Поставщик обязан:</p>
        <p>3.2.1. Не позднее, чем за 10 дней опубликовать предстоящие изменения настоящего Договора в сети Интернет:  <a href="http://smaip.ru/oferta.html">http://smaip.ru/oferta.html</a> и уведомить Фермера в любой форме указанной в п. 4.1 настоящего Договора, либо путем телефонных переговоров с использованием номера контактного телефона Фермера.</p>
        <p>3.3.Подписывая настоящий Договор, Фермер считается ознакомленным с дополнительными условиями, которые являются неотъемлемой частью настоящего Договора и размещены Поставщиком в сети Интернет: <a href="http://smaip.ru/dopsoglashenie.html">http://smaip.ru/dopsoglashenie.html</a>.</p>
        <h3 class="my-4">4. РАСЧЕТЫ И ПОРЯДОК ОПЛАТЫ</h3>
        <p>4.1. Передача пищевых отходов осуществляется по передаточному документу, составленному в момент вывоза вторсырья (пищевых отходов) между Фермером и объектом образования вторсырья (пищевых отходов), по доверенности.</p>
        <p>4.2. Стоимость пищевых отходов Поставщик устанавливает в одностороннем порядке в срок не позднее 20-го числа предыдущего месяца и оповещает о ней Фермера путем отправки квитанции любым способом, указанном в п. 5.1 настоящего Договора, либо путем телефонных переговоров с использованием номера контактного телефона Фермера.
        </p>
        <p>4.3. В случае, если Фермер в течение месяца получит пищевые отходы свыше нормы, установленной настоящим договором, Поставщик вправе потребовать доплату, путем выставления квитанции по установленному тарифу. Отправка квитанции осуществляется любым способом, указанном в п. 5.1 настоящего Договора, либо путем телефонных переговоров с использованием номера контактного телефона Фермера, который обязан оплатить выставленную квитанцию в течение 3 календарных дней.
        </p>
        <p>4.3.1. Поставщик вправе установить еженедельную форму оплаты, в случае если из объекта в предыдущем месяце отгрузка была произведена свыше установленной нормы.</p>
        <p>4.3.2. При установлении временной еженедельной оплаты Фермер обязан произвести оплату не позднее суток с момента отправки квитанции согласно предоставленному весу отгрузки</p>
        <p>4.4. Оплату за пищевые отходы Фермер производит на следующий месяц авансовым платежом по квитанции в срок не позднее 24-го числа предыдущего месяца в безналичном порядке, путем перечисления на расчетный счет Поставщика. </p>
        <p>4.5. В случае нарушений условий настоящего договора Фермером, возврат ранее внесенного платежа не производится.</p>
        <h3 class="my-4">5. ПРОЧИЕ УСЛОВИЯ</h3>
        <p>5.1. Любые изменения по настоящему Договору должны быть выполнены в письменной форме и подписаны Сторонами.
          Письменная форма считается соблюденной и в случае совершения сделки с помощью электронных либо иных технических средств, позволяющих воспроизвести на материальном носителе в неизменном виде содержание сделки, при этом требование о наличии подписи считается выполненным, если использован любой способ, позволяющий достоверно определить Сторону настоящего Договора,  в т.ч. посредством обмена письмами по электронной почте и личной переписки в мессенджерах (Telegram, Viber, WhatsApp).
        </p>
        <h3 class="my-4">6. ОТВЕТСТВЕННОСТЬ СТОРОН И СРОК ДЕЙСТВИЯ ДОГОВОРА</h3>
        <p>6.1. За неисполнение или ненадлежащее исполнение обязательств по настоящему договору стороны несут ответственность в соответствии с действующим законодательством и дополнительными условиями к настоящему Договору. </p>
        <p>6.2. В случае наложения государственными органами контроля, надзора (Администрация муниципального образования, Прокуратура, Роспотребнадзор, Росприроднадзор, Россельхознадзор и др.) штрафных санкций на Поставщика в результате нарушения Фермером условий договора, Фермер по письменному требованию Поставщика возмещает ему понесенные убытки в виде уплаченного административного штрафа в течение 5 (пяти) рабочих дней.</p>
        <p>6.3. В случае несоблюдения Фермером условий ежедневного вывоза пищевых отходов, в нарушение п.3.1.1 Договора, Поставщик вправе  требовать от Фермера штраф в размере 800 (восемьсот) рублей за каждый факт не вывоза отходов в установленный срок, а также независимо от этого возместить причиненные убытки в полном объеме. В случае не вывоза пищевого отхода Фермером по его вине платеж по настоящему договору не возвращается.</p>
        <p>6.4. В случае выявления факта продажи Фермером пищевых отходов третьим лицам либо фактов утилизации пищевых отходов в мусорные баки ТБО, не принадлежащих Фермеру, и урны общего пользования, в нарушение п. 3.1.2. Договора, Поставщик вправе требовать от Фермера штраф в размере 100 000 рублей, а также независимо от этого возместить причиненные убытки в полном объеме. При этом Поставщик имеет право в одностороннем порядке расторгнуть настоящий договор и отозвать оферту в отношении данного лица. Уведомление о расторжении направляется в соответствии с п. 5.1. настоящего документа.</p>
        <p>6.5. Настоящий договор заключается на срок по 31 декабря текущего года и считается ежегодно продленным на тот же срок и на тех же условиях, если за 30 дней до окончания срока действия договора не последует письменного заявления одной из сторон о его расторжении или изменении. </p>
        <p>6.6. Любая из сторон настоящего договора может расторгнуть настоящий договор  с 1 числа следующего месяца, оповестив любым способом, либо телефонных переговоров с использованием номера контактного телефона Фермера. В случае несоблюдения Фермером условий настоящего договора, Поставщик оставляет за собой право расторгнуть договор в одностороннем порядке в день выявления нарушений, уведомив  любым способом, указанном в п. 6.1 настоящего Договора, либо путем телефонных переговоров с использованием номера контактного телефона Фермера.<br>С момента заключения настоящего Договора, все ранее заключенные Сторонами договоры утрачивают силу.</p>
        <h3 class="my-4">7. КОНФИДЕНЦИАЛЬНОСТЬ</h3>
        <p>7.1. Каждая из Сторон обязана соблюдать коммерческую тайну относительно конфиденциальной информации, полученной от другой Стороны в связи с исполнением обязательств по настоящему Договору.</p>
        <p>7.2. Каждая из Сторон вправе вести запись телефонных переговоров в целях контроля за исполнением условий настоящего Договора.</p>
        <p>7.3. Подписывая настоящий Договор, Фермер дает согласие  Поставщику на обработку своих персональных данных, а именно ФИО, данные документа, удостоверяющего личность, в т.ч. личные номера телефонов, государственный номер автомобиля, адрес электронной почты и иную информацию необходимую в рамках договорных отношений.</p>
        <p>7.4. Сторона, в результате виновных действий которой произошло разглашение конфиденциальной информации, возмещает другой Стороне штраф в размере 50 000 рублей.</p>
        <h3 class="my-4">8. РАЗРЕШЕНИЕ СПОРОВ</h3>
        <p>8.1 Стороны обязуются принять все меры к разрешению споров и разногласий, которые могут возникнуть из настоящего Договора или в связи с ним, путем переговоров. Стороны устанавливают претензионный порядок рассмотрения споров. Сторона обязана ответить на претензию в течение 10 календарных дней со дня ее получения</p>
        <p>8.2. В случае не достижения договоренности в досудебном порядке, все споры между Поставщиком и Фермером рассматриваются в суде по месту нахождения Поставщика.</p>
        <h3 class="my-4">9. СРОК ДЕЙСТВИЯ И ИЗМЕНЕНИЯ ДОГОВОРА</h3>
        <p>9.1 Акцепт Оферты Фермером создает Договор (статья 438 Гражданского Кодекса РФ) на условиях Оферты.</p>
        <p>9.2 Договор вступает в силу с момента Акцепта Оферты Фермером и действует: а) до момента исполнения обязательств по оказанию услуг в объеме, соответствующем размеру произведенной по Договору предоплаты, б) до момента расторжения Договора.
        </p>
        <p>9.3 Фермер соглашается и признает, что внесение изменений в Оферту влечет за собой внесение этих изменений в заключенный и действующий между Фермером и Поставщиком Договор, и эти изменения в Договор вступают в силу одновременно с такими изменениями в Оферте.</p>
        <p>9.4 В случае отзыва Оферты Поставщиком в течение срока действия Договора, Договор считается прекращенным с момента отзыва, а предоплата возвращается Фермеру в порядке, установленном в договоре Оферты.</p>
        <h3 class="my-4">10. ЮРИДИЧЕСКИЕ АДРЕСА И РЕКВИЗИТЫ ПРОДАВЦА</h3>
        <div class="row">
          <div class="col-12 col-md-6">
            <p>ПРОДАВЕЦ<br>
              Cидоров Максим Александрович<br>
              ИНН 110901212063<br>
              ОГРНИП 319112100030761<br>
              Юридический адрес: Юридический адрес: 167000, г. Сыктывкар, ул. Южная, д. 18 кв. 11<br>
              Почтовый адрес: 167001 Республика Коми, г.Сыктывкар, а/я 415<br>
              Р/с 40802810528000011871<br>
              Коми отделение №8617 ПАО "Сбербанк" г.Сыктывкар<br>
              к/с 30101810400000000640, БИК 048702640<br>
              Телефон 8904-271-32-22<br>
              s566663@yandex.ru</p>
            <div style="display:flex;align-items:flex-end;">
              <span>Подпись</span>
              <img style="width: 50px; margin-left: 10px" :src="require('../../public/img/signature.png')">
              <span class="ms-4">Сидоров М.А.</span>
            </div>
            <span>________________/_______________/</span><br>
            <span style="font-size:8pt">(расшифровка)</span>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import { mapActions, mapGetters } from 'vuex'

export default {
  name: 'Contract',
  data: () => ({
    notify: false,
    accept: false
  }),
  computed: {
    ...mapGetters([
      'SIDEBAR'
    ])
  },
  methods: {
    ...mapActions([
      'CLOSE_SIDEBAR'
    ])
  },
  mounted () {
    this.CLOSE_SIDEBAR()
  }
}
</script>
